import { useState, useEffect } from 'react';

// Нужен хук для роутинга
import { useNavigate } from 'react-router-dom';

function Home() {
  // Напишем массивы для хранения данных с использованием деструкционализации

  // для переключения между страницами
  const navigate = useNavigate();

  // ============================================================================
  // ОСНОВНОЙ ИНТЕРФЕЙС
  // ============================================================================
  return (
    // Внешний контейнер для всей страницы
    <div className="page-home">
      <div className="card">
        <h1>Добро пожаловать в админку!</h1>
        <p>Здесь вы можете управлять инцидентами и пользователями.</p>
      </div>
      {/* card */}
    </div>
    // page-home
  );
}

export default Home;
