// Файл для работы с авторизацией
// используем память браузера
/* ============================================================================ */
/* ПОЛУЧЕНИЕ ПОЛЬЗОВАТЕЛЯ */
/* ============================================================================ */
export const getCurrentUser = () => {
  // нужно брать строку по ключу 'user'
  const userStd = localStorage.getItem('user');

  // строки нет? тогда пользователь не вошел
  if (!userStd) return null;

  // строка есть?
  // нужно превратить строку в объект для работы с JS
  // сделаем обработку try catch
  try{
    return JSON.parse(userStd);
  }catch(error){
    // данные повреждены?
    // удаляем
    localStorage.removeItem('user');
  }
};
/* ============================================================================ */
/* СОХРАНЕНИЕ ПОЛЬЗОВАТЕЛЯ */
// Внимание! Сначала нужно проверить пароль
/* ============================================================================ */
export const loginUser = (userData) => {
  // здесь наоборот нужно превратить объект JS в строку
  const userStr = JSON.stringify(userData);
  // сохраняем
  localStorage.setItem('user', userStr);
};
/* ============================================================================ */
/* УДАЛИТЬ ПОЛЬЗОВАТЕЛЯ */
/* ============================================================================ */
export const logoutUser = () => {
  // удаляем из памяти
  localStorage.removeItem('user');
}