// Файл для сохранения геолокации пользователя (локально)
// используем память браузера
/* ============================================================================ */
/* ПОЛУЧЕНИЕ ГЕОЛОКАЦИИ */
/* ============================================================================ */
export const getGeoData = () => {
  // нужно брать строку по ключу 'geo'
  const geoStr = localStorage.getItem('geo');

  // строки нет? тогда первая загрузка
  if (!geoStr) return [55.751244, 37.618423];

  // строка есть?
  // нужно превратить строку в объект для работы с JS
  // сделаем обработку try catch
  try {
    return JSON.parse(geoStr);
  } catch (error) {
    // данные повреждены?
    // удаляем
    localStorage.removeItem('geo');
  }
};
/* ============================================================================ */
/* СОХРАНЕНИЕ ГЕОЛОКАЦИИ */
/* ============================================================================ */
export const saveGeoData = (geoData) => {
  // здесь наоборот нужно превратить объект JS в строку
  const geoStr = JSON.stringify(geoData);
  // сохраняем
  localStorage.setItem('geo', geoStr);
};
/* ============================================================================ */
/* СБРОС ГЕОЛОКАЦИИ */
/* ============================================================================ */
export const resetGeoData = () => {
  // удаляем из памяти
  localStorage.removeItem('geo');
};
