import { FIELD_LIMITS } from './fieldLimits';
export const useHandleChange = (setTitle, setDescription, setStatus, setType) => {
  // ============================================================================
  // ФУНКЦИЯ ОБРАБОТКИ ИЗМЕНЕНИЯ В ПОЛЕ TYPE
  // ============================================================================
  // Вызывается каждый раз, когда происходит изменение в поле
  const handleTypeChange = (e) => {
    // Берем текущий текст из поля с помощью e.target.value
    setType(e.target.value);
  };
  // ============================================================================
  // ФУНКЦИЯ ОБРАБОТКИ ИЗМЕНЕНИЯ В ПОЛЕ STATUS
  // ============================================================================
  // Вызывается каждый раз, когда происходит изменение в поле
  const handleStatusChange = (e) => {
    // Берем текущий текст из поля с помощью e.target.value
    setStatus(e.target.value);
  };
  // ============================================================================
  // ФУНКЦИЯ ОБРАБОТКИ ИЗМЕНЕНИЯ В ПОЛЕ TITLE
  // ============================================================================
  // Вызывается каждый раз, когда происходит изменение в поле
  const handleTitleChange = (e) => {
    // Берем текущий текст из поля с помощью e.target.value
    // Добавил лимит
    const value = e.target.value.slice(0, FIELD_LIMITS.title.max);
    setTitle(value);
  };
  // ============================================================================
  // ФУНКЦИЯ ОБРАБОТКИ ИЗМЕНЕНИЯ В ПОЛЕ DESCRIPTION
  // ============================================================================
  // Вызывается каждый раз, когда происходит изменение в поле
  const handleDescriptionChange = (e) => {
    // Берем текущий текст из поля с помощью e.target.value
    // Добавил лимит
    const value = e.target.value.slice(0, FIELD_LIMITS.description.max);
    setDescription(value);
  };
  return {
    handleTypeChange,
    handleStatusChange,
    handleTitleChange,
    handleDescriptionChange,
  };
};
